public class Main {
    public static void main(String[] args) {

        int amount = 40000; // цена билета
        int bonus = 20; // кол-во рублей для одной бонусной мили

        System.out.println("Итоговое количество миль: " + amount / bonus + " миль ");
    }


    // Объявляете переменные для входных данных и
    // параметров программы: одну для хранения
    // стоимости билета, другую для хранения количества
    // рублей для одной бонусной мили

    // Рассчитываете количество бонусных миль, используя
    // значения заведённых переменных. Ответ сохраняете в
    // новую переменную и выводите на экран

}